#!/usr/bin/python3

# IPA to hangul transcription
ipa_to_han = {
    "eɪ": "ㅔ이", 
    "aʊ": "ㅏ우",
    "aɪ": "ㅏ이", 
    "ər": "ㅓ얼", 
    "oʊ": "ㅗ우", 
    "ɔɪ": "ㅗ이", 
    "əʊ": "ㅓ우",
    "ts": "ㅊ",
    "wɑ": "와",
    "wə": "워",
    "wɪ": "위",
    "wi": "위",
    "we": "웨",
    "ʃə": "셔",
    "ʃe": "쉐",
    "ʃɑ": "샤",
    "ʤ": "ㅈ", 
    "ʧ": "ㅊ",
    "æ": "ㅐ", 
    "a": "ㅏ",
    "b": "ㅂ",
    "d": "ㄷ",
    "e": "ㅔ",
    "f": "`ㅍ",
    "g": "ㄱ",
    "i": "ㅣ",
    "k": "ㅋ",
    "l": "ㄹ",
    "m": "ㅁ",
    "n": "ㄴ",
    "o": "ㅗ",
    "p": "ㅍ",
    "q": "ㅋ",
    "r": "`ㄹ",
    "s": "ㅅ",
    "t": "ㅌ",
    "v": "`ㅂ",
    "w": "ㅝ",
    "x": "ㅋㅅ",
    "z": "`ㅈ",
    "ə": "ㅓ",
    "ɑ": "ㅏ",
    "ɔ": "ㅗ",
    "ð": "`ㄷ",
    "ɛ": "ㅔ",
    "h": "ㅎ",
    "ɪ": "ㅣ",
    "ŋ": "ㅇ",
    "ʃ": "쉬",
    "θ": "`ㄸ",
    "ʊ": "ㅜ",
    "u": "ㅜ",
    "ʒ": "ㅈ",
    "i": "ㅣ",
    "j": "ㅠ",
    }

# Hangul initial consonants
han_initial = ['ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ', 'ㅂ', 'ㅃ',
        'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']

# Hangul vowels
han_vowel = ['ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ', 'ㅖ', 'ㅗ', 'ㅘ',
        'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ', 'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ',
        'ㅣ']

# Hangul final consonants
han_final = [None, 'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ', 'ㄷ', 'ㄹ', 'ㄺ',
        'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ', 'ㄿ', 'ㅀ', 'ㅁ', 'ㅂ', 'ㅄ', 'ㅅ',
        'ㅆ', 'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ']

# Hangul initial consonants, which can also naturally be final
han_initfin = ['ㅁ', 'ㄴ', 'ㄹ', 'ㅇ']

# Hangul vowels by shape
vertical_han_vowel = ['ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ', 'ㅖ', 'ㅣ'] 
horizontal_han_vowel = ['ㅗ', 'ㅛ', 'ㅜ', 'ㅠ', 'ㅡ'] 
wide_han_vowel = ['ㅘ', 'ㅙ', 'ㅚ', 'ㅝ', 'ㅞ', 'ㅟ', 'ㅢ']
